resources/SetParameterValues.xml

<soap:Envelope
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:cwmp="urn:dslforum-org:cwmp-1-1">
<soap:Header>
</soap:Header>
<soap:Body>
<cwmp:SetParameterValues>
<ParameterList soapenc:arrayType="cwmp:ParameterValueStruct[2]">
<ParameterValueStruct>
<Name>InternetGatewayDevice.Foo</Name>
<Value xsi:type="xsd:string">foo</Value>
</ParameterValueStruct>
<ParameterValueStruct>
<Name>InternetGatewayDevice.Bar</Name>
<Value xsi:type="xsd:unsignedInt">100</Value>
</ParameterValueStruct>
</ParameterList>
<ParameterKey>1234</ParameterKey>
</cwmp:SetParameterValues>
</soap:Body>
</soap:Envelope>