Server/kennel/monitor/sip/soap/soap/cwmp.GetParameterValues.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="urn:dslforum-org:cwmp-1-1">
 <SOAP-ENV:Body>
   <ns1:GetParameterValues>
    <DeviceId>
     <Manufacturer></Manufacturer>
     <OUI></OUI>
     <ProductClass></ProductClass>
     <SerialNumber></SerialNumber>
    </DeviceId>
    <Ip></Ip>
    <ParameterNames SOAP-ENC:arrayType="xsd:string[1]">
     <string></string>
    </ParameterNames>
   </ns1:GetParameterValues>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
