Server/kennel/monitor/sip/soap/soap/cwmp.SetParameterAttributes.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="urn:dslforum-org:cwmp-1-1">
 <SOAP-ENV:Body>
   <ns1:SetParameterAttributes>
    <DeviceId>
     <Manufacturer></Manufacturer>
     <OUI></OUI>
     <ProductClass></ProductClass>
     <SerialNumber></SerialNumber>
    </DeviceId>
    <Ip></Ip>
    <ParameterList SOAP-ENC:arrayType="ns1:SetParameterAttributesStruct[1]">
     <SetParameterAttributesStruct>
      <Name></Name>
      <NotificationChange>false</NotificationChange>
      <Notification>0</Notification>
      <AccessListChange>false</AccessListChange>
      <AccessList SOAP-ENC:arrayType="xsd:string[1]">
       <string></string>
      </AccessList>
     </SetParameterAttributesStruct>
    </ParameterList>
   </ns1:SetParameterAttributes>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
