cpetools/message/SetParameterValues.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:cwmp1="urn:dslforum-org:cwmp-1-1">
 <SOAP-ENV:Header>
  <cwmp1:HoldRequests SOAP-ENV:mustUnderstand="">false</cwmp1:HoldRequests>
  <cwmp1:ID SOAP-ENV:mustUnderstand=""></cwmp1:ID>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <cwmp1:SetParameterValues>
    <ParameterList SOAP-ENC:arrayType="cwmp1:ParameterValueStruct[1]">
     <ParameterValueStruct>
      <Name></Name>
      <Value></Value>
     </ParameterValueStruct>
    
     <ParameterValueStruct>
      <Name></Name>
      <Value></Value>
     </ParameterValueStruct>
    </ParameterList>
    <ParameterKey></ParameterKey>
   </cwmp1:SetParameterValues>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
